# frozen_string_literal: true

# Configuration
cask_args appdir: '/Applications'

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================

## Version Control
brew 'git'
brew 'gh' # GitHub CLI
brew 'asdf'

## DevOps & Infrastructure
brew 'awscli'
brew 'terraform'
brew 'terragrunt'
brew 'kind' # Kubernetes in Docker
brew 'kubectl'
brew 'helm'
brew 'kustomize'

## AI Development
brew 'codex'
brew 'gemini-cli'

# =============================================================================
# SYSTEM UTILITIES
# =============================================================================

## Libraries
brew 'libjpeg'
brew 'libpng'

## Database
brew 'postgresql'

## Network & HTTP
brew 'curl'

# =============================================================================
# PROGRAMMING LANGUAGES & RUNTIMES
# =============================================================================

## Node.js Ecosystem
brew 'node'
brew 'yarn'
brew 'uv'

## Language Version Managers
# brew 'rust'

# =============================================================================
# TEXT PROCESSING & SEARCH
# =============================================================================

brew 'jq'
brew 'tig'
brew 'ag' # The Silver Searcher

# =============================================================================
# SHELL & TERMINAL
# =============================================================================

brew 'zsh'
brew 'zsh-syntax-highlighting'

# =============================================================================
# THIRD-PARTY TAPS
# =============================================================================

brew 'stacklok/tap/thv'

# =============================================================================
# GUI APPLICATIONS (CASKS)
# =============================================================================

## AI
cask 'cursor'
cask 'block-goose' # Focus and website blocking tool
cask 'warp'

## Development & Code
cask 'visual-studio-code'
cask 'altair-graphql-client'
cask 'dbeaver-community'

## Communication & Collaboration
cask 'slack'
cask 'discord'

## Browsers
cask 'google-chrome'

## DevOps & Infrastructure
cask 'pritunl'
cask 'hashicorp/tap/hashicorp-boundary-desktop'
cask 'rancher'
cask 'proxyman'
cask 'google-cloud-sdk'

## Productivity
cask 'raycast'
cask 'sizeup'

## Media & Entertainment
cask 'spotify'

