# frozen_string_literal: true

# config
cask_args appdir: '/Applications'

## Development tools
brew 'git'
brew 'gh' # GitHub CLI
brew 'awscli'
brew 'curl'

### Languages
brew 'node'
brew 'yarn'
brew 'asdf'
brew 'uv'
# brew 'rust'

## Text processing
brew 'jq'
brew 'tig'
brew 'ag'

## Infrastructure/DevOps
brew 'kind' # Kubernetes in Docker
brew 'kubectl'
brew 'helm'
brew 'kustomize'
brew 'terraform'
tap 'stacklok/tap'
brew 'thv'

# zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Casks (GUI applications):
cask 'visual-studio-code'
cask 'warp'
cask 'slack'
cask 'pritunl'
cask 'altair-graphql-client'
cask 'google-chrome'
cask 'spotify'
cask 'hashicorp/tap/hashicorp-boundary-desktop'
cask 'rancher'
cask 'sizeup'
cask 'raycast'
cask 'dbeaver-community'
cast 'proxyman'
cast 'discord'

