apollographql.vscode-apollo
be5invis.toml
bradlc.vscode-tailwindcss
datadog.datadog-vscode
davidanson.vscode-markdownlint
dracula-theme.theme-dracula
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
hashicorp.terraform
jeff-hykin.better-dockerfile-syntax
liamhammett.inline-parameters
marquesmps.dockerfile-validator
meganrogge.template-string-converter
prisma.prisma
rangav.vscode-thunder-client
redhat.vscode-yaml
rust-lang.rust-analyzer
shopify.ruby-lsp
statelyai.stately-vscode
streetsidesoftware.avro
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tgriesser.avro-schemas
tomaszbartoszewski.avro-tools
usernamehw.errorlens
vadimcn.vscode-lldb
wix.vscode-import-cost
yoavbls.pretty-ts-errors
